import numpy as np
from Comparison import Comparison

# ACTUAL

# CRITERIA = {
#     "Вартість використання": np.array(["Безкоштовно", "Платний API", "Комерційна підписка", "Покупка моделі"]),
#     "Допустима кількість запитів на хвилину": np.array(["Без обмежень", "Велика", "Середня", "Мала"]),
#     "Актуальність інформації": np.array(["Актуальна", "Минулорічна", "Припустима", "Застаріла"]),
#     "Якість згенерованого коду": np.array(["Високий", "Середній", "Низький", "Неприйнятний"])
# }

# ALTERNATIVES = {
#     "GPT-4": np.array([
#         CRITERIA['Вартість використання'][3],
#         CRITERIA['Допустима кількість запитів на хвилину'][0],
#         CRITERIA['Актуальність інформації'][1],
#         CRITERIA['Якість згенерованого коду'][2]]),
#     "GPT-3.5": np.array([
#         CRITERIA['Вартість використання'][2],
#         CRITERIA['Допустима кількість запитів на хвилину'][3],
#         CRITERIA['Актуальність інформації'][0],
#         CRITERIA['Якість згенерованого коду'][1]]),
#     "Gemini": np.array([
#         CRITERIA['Вартість використання'][1],
#         CRITERIA['Допустима кількість запитів на хвилину'][2],
#         CRITERIA['Актуальність інформації'][3],
#         CRITERIA['Якість згенерованого коду'][0]]),
#     "WizardCoder": np.array([
#         CRITERIA['Вартість використання'][0],
#         CRITERIA['Допустима кількість запитів на хвилину'][1],
#         CRITERIA['Актуальність інформації'][2],
#         CRITERIA['Якість згенерованого коду'][3]]),
# }

# FOR TESTS

CRITERIA = {
    "Відстань до компанії": np.array(["Мала", "Середня", "Велика"]),
    "Заробітна плата": np.array(["Велика", "Середня", "Мала"]),
    "Розмір відпустки": np.array(["Велика", "Середня", "Мала"]),
}

# ALTERNATIVES = {
#     "GlobalLogic": np.array([
#         CRITERIA['Відстань до компанії'][0],
#         CRITERIA['Заробітна плата'][1],
#         CRITERIA['Розмір відпустки'][2]]),
#     "Intetics": np.array([
#         CRITERIA['Відстань до компанії'][1],
#         CRITERIA['Заробітна плата'][2],
#         CRITERIA['Розмір відпустки'][0]]),
#     "Program-Ace": np.array([
#         CRITERIA['Відстань до компанії'][2],
#         CRITERIA['Заробітна плата'][0],
#         CRITERIA['Розмір відпустки'][1]])
# }

ALTERNATIVES = {
    "GlobalLogic": np.array([0, 1, 2]),
    "Intetics": np.array([1, 2, 0]),
    "Program-Ace": np.array([2, 0, 1])
}


COMPARISON1 = Comparison(['Відстань до компанії', 'Заробітна плата'],
                         {0: np.array([0, 0, 0]), 1: np.array([1, 0, 0]), 2: np.array([2, 0, 0]), 3: np.array(
                             [0, 0, 0]), 4: np.array([0, 1, 0]), 5: np.array([0, 2, 0])},
                         {(1, 4): '>', (1, 5): '>', (2, 4): '<', (2, 5): '<'},
                         {0: [1], 1: [2, 4, 5], 2: [],
                             3: [4], 4: [5, 2], 5: [2]},
                         [0, 1, 4, 5, 2])

COMPARISON2 = Comparison(['Відстань до компанії', 'Розмір відпустки'],
                         {0: np.array([0, 0, 0]), 1: np.array([1, 0, 0]), 2: np.array([2, 0, 0]), 3: np.array(
                             [0, 0, 0]), 4: np.array([0, 0, 1]), 5: np.array([0, 0, 2])},
                         {(1, 4): '>', (1, 5): '>', (2, 4): '<', (2, 5): '>'},
                         {0: [1], 1: [2, 4, 5], 2: [5],
                             3: [4], 4: [5, 2], 5: []},
                         [0, 1, 4, 2, 5])

COMPARISON3 = Comparison(['Заробітна плата', 'Розмір відпустки'],
                         {0: np.array([0, 0, 0]), 1: np.array([0, 1, 0]), 2: np.array([0, 2, 0]), 3: np.array(
                             [0, 0, 0]), 4: np.array([0, 0, 1]), 5: np.array([0, 0, 2])},
                         {(1, 4): '<', (1, 5): '>', (2, 4): '<', (2, 5): '>'},
                         {0: [1], 1: [2, 5], 2: [5], 3: [
                             4], 4: [5, 1, 2], 5: []},
                         [3, 4, 1, 2, 5])
